jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32S1xx_DFP.pdsc
        <condition id="APM32S1xx">
            <description>Geehy Semiconductor APM32S1xx Device</description>
            <require Dvendor="Geehy:163" Dname="APM32S1*"/>
        </condition>
        <condition id="APM32S1xx LD">
            <description>Geehy Semiconductor APM32S1xx Low Density Device</description>
            <require Dvendor="Geehy:163" Dname="APM32S10[123]?[46]"/>
        </condition>
        <condition id="APM32S1xx MD">
            <description>Geehy Semiconductor APM32S1xx Mid Density Device</description>
            <require Dvendor="Geehy:163" Dname="APM32S10[123]?[8B]"/>
        </condition>
        <condition id="APM32S1xx LD ARMCC">
            <description>filter for APM32S1xx Low Density Device and the ARM compiler</description>
            <require condition="APM32S1xx LD"/>
            <require Tcompiler="ARMCC"/>
        </condition>
        <condition id="APM32S1xx MD ARMCC">
            <description>filter for APM32S1xx Mid Density Device and the ARM compiler</description>
            <require condition="APM32S1xx MD"/>
            <require Tcompiler="ARMCC"/>
        </condition>
        <condition id="APM32S1xx CMSIS">
            <description>Geehy Semiconductor APM32S1xx Device with CMSIS</description>
            <require condition="APM32S1xx"/>
            <require Cclass="CMSIS" Cgroup="CORE"/>
        </condition>
        <condition id="APM32S1xx STDPERIPH">
            <description>Geehy Semiconductor APM32S1xx with Standard Peripherals Drivers Framework</description>
            <require condition="APM32S1xx CMSIS"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
        </condition>
        <condition id="APM32S1xx STDPERIPH RCM">
            <description>Geehy Semiconductor APM32S1xx with Standard Peripherals Drivers Framework and RCM</description>
            <require condition="APM32S1xx CMSIS"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCM"/>
        </condition>
    </conditions>
    <components>
        <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="APM32S1xx CMSIS">
            <description>System Startup for Geehy Semiconductor APM32S1xx device series</description>
            <files>
                <!--  include folder -->
                <file category="include" name="Device/Device/Geehy/APM32S10x/Include/"/>
                <!-- startup files -->
                <file category="source" name="Device/Device/Geehy/APM32S10x/Source/arm/startup_apm32s10x_md.s" attr="config" version="1.0.0" condition="APM32S1xx MD ARMCC"/>
                <!-- system file -->
                <file category="source" name="Device/Device/Geehy/APM32S10x/Source/system_apm32s10x.c" attr="config" version="1.0.1"/>
                <!-- device configuration required by drivers at the moment -->
            </files>
        </component>
        <!-- START: Geehy Semiconductor Standard Peripherals Drivers -->
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="1.0.1" condition="APM32S1xx STDPERIPH">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FRAMEWORK</RTE_Components_h>
            <files>
                <file category="include" name="Device/StdPeriphDriver/inc/"/>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_misc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_misc.c"/>
                <file category="header" name="Device/Templates/apm32s10x_int.h" attr="template" select="Interrupt Service Routines"/>
                <file category="source" name="Device/Templates/apm32s10x_int.c" attr="template" select="Interrupt Service Routines"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC" Cversion="1.0.1" condition="APM32S1xx STDPERIPH RCM">
            <description>Analog-to-digital converter (ADC) driver for APM32S10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_ADC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_adc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_adc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="BAKPR" Cversion="1.0.1" condition="APM32S1xx STDPERIPH">
            <description>Backup registers (BAKPR) driver for APM32S10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_BAKR</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_bakpr.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_bakpr.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="1.0.1" condition="APM32S1xx STDPERIPH RCM">
            <description>Controller area network (CAN) driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CAN</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_can.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_can.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC" Cversion="1.0.1" condition="APM32S1xx STDPERIPH">
            <description>CRC calculation unit (CRC) driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CRC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_crc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_crc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMA" Cversion="1.0.1" condition="APM32S1xx STDPERIPH RCM">
            <description>DMA controller (DMA) driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DMA</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_dma.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_dma.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EINT" Cversion="1.0.1" condition="APM32S1xx STDPERIPH">
            <description>External interrupt/event controller (EINT) driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_EINT</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_eint.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_eint.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FMC" Cversion="1.0.1" condition="APM32S1xx STDPERIPH">
            <description>Flash memory controller driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FMC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_fmc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_fmc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO" Cversion="1.0.1" condition="APM32S1xx STDPERIPH RCM">
            <description>General-purpose I/O (GPIO) driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_GPIO</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_gpio.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_gpio.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="I2C" Cversion="1.0.1" condition="APM32S1xx STDPERIPH RCM">
            <description>Inter-integrated circuit (I2C) interface driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_I2C</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_i2c.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_i2c.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="IWDT" Cversion="1.0.1" condition="APM32S1xx STDPERIPH">
            <description>Independent watchdog (IWDT) driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_IWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_iwdt.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_iwdt.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="PMU" Cversion="1.0.1" condition="APM32S1xx STDPERIPH RCM">
            <description>Power controller (PMU) driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_PMU</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_pmu.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_pmu.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCM" Cversion="1.0.1" condition="APM32S1xx STDPERIPH">
            <description>Reset and clock management unit (RCM) driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RCM</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_rcm.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_rcm.c"/>
            </files>
        </component>
