jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32S1xx_DFP.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI" Cversion="1.0.1" condition="APM32S1xx STDPERIPH RCM">
            <description>Serial peripheral interface (SPI) driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SPI</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_spi.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_spi.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="QSPI" Cversion="1.0.1" condition="APM32S1xx STDPERIPH RCM">
            <description>Queued Serial peripheral interface (QSPI) driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_QSPI</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_qspi.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_qspi.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TMR" Cversion="1.0.1" condition="APM32S1xx STDPERIPH RCM">
            <description>Timers (TMR) driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_TMR</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_tmr.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_tmr.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART" Cversion="1.0.1" condition="APM32S1xx STDPERIPH RCM">
            <description>Universal synchronous asynchronous receiver transmitter (USART) driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_USART</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_usart.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_usart.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDT" Cversion="1.0.1" condition="APM32S1xx STDPERIPH RCM">
            <description>Window watchdog (WWDT) driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_WWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_wwdt.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_wwdt.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DBGMCU" Cversion="1.0.1" condition="APM32S1xx STDPERIPH">
            <description>MCU debug component (DBGMCU) driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DBGMCU</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_dbgmcu.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_dbgmcu.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC" Cversion="1.0.1" condition="APM32S1xx STDPERIPH">
            <description>Real-time clock (RTC) driver for APM32S1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RTC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32s10x_rtc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32s10x_rtc.c"/>
            </files>
        </component>
        <!-- END: Geehy Semiconductor Standard Peripherals Drivers -->
    </components>
    <boards>
        <board vendor="Geehy" name="APM32S103MINI" revision="Ver 1.0">
            <description>Geehy APM32S103 Development Board</description>
            <image large="Boards/Geehy/APM32S103MINI/Documentation"/>
            <mountedDevice deviceIndex="0" Dvendor="Geehy:163" Dname="APM32S103"/>
            <compatibleDevice deviceIndex="0" Dvendor="Geehy:163" DsubFamily="APM32S103"/>
            <feature type="XTAL" n="8000000"/>
            <feature type="PWR" n="5" name="USB Powered"/>
            <feature type="USB" n="1" name="USB 2.0 Full Speed Device"/>
            <feature type="RS232" n="1"/>
            <feature type="Button" n="3" name="Reset, KEY1 and KEY2"/>
            <feature type="LED" n="2" name="LEDs directly connected to port pins"/>
            <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
        </board>
    </boards>
    <examples>
        <example name="APM32S103MINI-Blinky" doc="readme.txt" folder="Boards/Geehy/APM32S103MINI/Blinky">
            <description>APM32S103_MINI Blinky example</description>
            <board name="APM32S103MINI" vendor="Geehy"/>
            <project>
                <environment name="uv" load="APM32S103MINI-Blinky.uvprojx"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>LED</keyword>
                <keyword>APM32S103</keyword>
            </attributes>
        </example>
    </examples>
</package>
